---
kind: property
id: P:Autodesk.Revit.DB.ReferenceIntersector.TargetType
zh: 射线、射线相交
source: html/c7a99118-5365-2baf-2494-1879cb06038e.htm
---
# Autodesk.Revit.DB.ReferenceIntersector.TargetType Property

**中文**: 射线、射线相交

The type of reference to find.

## Syntax (C#)
```csharp
public FindReferenceTarget TargetType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration